In [1]:
import pandas as pd

# 使用字典创建 DataFrame 并指定列名作为索引
mydata = {'Column1': [1, 2, 3], 'Column2': ['a', 'b', 'c']}
df = pd.DataFrame(mydata)
df

   Column1 Column2
0        1       a
1        2       b
2        3       c

In [2]:
# 指定行索引
df.index = ['row1', 'row2', 'row3']
df

      Column1 Column2
row1        1       a
row2        2       b
row3        3       c

In [3]:
# 使用另一个 Series 或数组作为索引
index_series = pd.Series(['row_index_1', 'row_index_2', 'row_index_3'])
df.index = index_series
df

             Column1 Column2
row_index_1        1       a
row_index_2        2       b
row_index_3        3       c

In [4]:
# 创建 DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': ['a', 'b', 'c']
}, index=['row1', 'row2', 'row3'])

# 访问特定行和列的值
value = df.loc['row1', 'A']  # 访问 'row1' 行 'A' 列的值
value

1

In [5]:
# 修改特定行和列的值
df.loc['row1', 'A'] = 100
df

        A  B
row1  100  a
row2    2  b
row3    3  c

In [7]:
# 访问 DataFrame 中的所有值
all_values = df.values
all_values

array([[100, 'a'],
       [2, 'b'],
       [3, 'c']], dtype=object)

In [8]:
# 访问 DataFrame 中的特定列的值
column_values = df['A']
column_values

row1    100
row2      2
row3      3
Name: A, dtype: int64

In [9]:
import pandas as pd  
weather_data = {  
'date':['2021-03-21','2021-03-22','2021-03-23'],  
'temperature':[25,26,27],  
'humidity':[81, 50, 56]  
}  
weather_df = pd.DataFrame(weather_data)  
weather_df

         date  temperature  humidity
0  2021-03-21           25        81
1  2021-03-22           26        50
2  2021-03-23           27        56

In [10]:
import pandas as pd  
weather_data = [  
('2021-03-21',25,81),  
('2021-03-22',26,50),  
('2021-03-23',27,56)  
]  
weather_df = pd.DataFrame(data = weather_data, columns=['date', 'temperature', 'humidity'])  
weather_df

         date  temperature  humidity
0  2021-03-21           25        81
1  2021-03-22           26        50
2  2021-03-23           27        56

In [11]:

import pandas as pd  
weather_data = [  
{'date':'2021-03-21','temperature':'25','humidity':'81'},  
{'date':'2021-03-22','temperature':'26','humidity':'50'},  
{'date':'2021-03-23','temperature':'27','humidity':'56'}  
]  
weather_df = pd.DataFrame(data = weather_data,  
columns=['date', 'temperature', 'humidity'])  
weather_df

         date temperature humidity
0  2021-03-21          25       81
1  2021-03-22          26       50
2  2021-03-23          27       56

In [12]:
weather_df = pd.DataFrame(data = weather_data,  
columns=['date', 'temperature', 'humidity'],  
index = ['row_index_1','row_index_2','row_index_3']  
)
weather_df

                   date temperature humidity
row_index_1  2021-03-21          25       81
row_index_2  2021-03-22          26       50
row_index_3  2021-03-23          27       56

In [13]:

import pandas as pd  
weather_data = {  
'date':['2021-03-21','2021-03-22','2021-03-23'],  
'temperature':[25,26,27],  
'humidity':[81, 50, 56],  
}  
weather_df = pd.DataFrame(weather_data,columns=['date','temperature','humidity','event'])  
weather_df

         date  temperature  humidity event
0  2021-03-21           25        81   NaN
1  2021-03-22           26        50   NaN
2  2021-03-23           27        56   NaN

In [14]:
import pandas as pd  
data = [  
[1,2,3,4,5],  
[6,7,8,9,10],  
[11,11,12,13,14],  
[15,16,17,18,19],  
[20,21,22,23,24],  
[25,26,27,28,29],  
[30,31,32,33,34],  
[35,36,37,38,39],  
[40,41,42,43,44],  
[45,46,47,48,49]  
]  
index = ['01', '02', '03', '04', '05','06', '07', '08', '09', '10']  
column=['C001', 'C002', 'C003','C004','C005']
df_example = pd.DataFrame(data= data,index=index,columns=column)
df_example

    C001  C002  C003  C004  C005
01     1     2     3     4     5
02     6     7     8     9    10
03    11    11    12    13    14
04    15    16    17    18    19
05    20    21    22    23    24
06    25    26    27    28    29
07    30    31    32    33    34
08    35    36    37    38    39
09    40    41    42    43    44
10    45    46    47    48    49

In [16]:
import pandas as np
import numpy as np
df = pd.DataFrame([[1.2,-2.5,0.3],[-4.2,1.5,np.nan],  
[np.nan,np.nan,np.nan],[-0.5,2.3,0.6]],  
index = ['A','B','C','D'],  
columns= ['num_1','num_2','num_3'])
df

   num_1  num_2  num_3
A    1.2   -2.5    0.3
B   -4.2    1.5    NaN
C    NaN    NaN    NaN
D   -0.5    2.3    0.6